using Sirenix.OdinInspector;
using System.Collections.Generic;
using UnityEngine;

using PatternState = BossPatternStateBase;

public class BossIdleState : BossStateBase
{
    [HideReferenceObjectPicker]
    [SerializeField] private List<PatternState> patterns;

    protected override void OnEnable()
    {
        
    }

    protected override void OnDisable()
    {
        
    }
}

//보스 패턴은 어떻게 할까...
//일단 생각해둔건...
//일반 패턴 (가볍게 공격하는 방식)
//기본적으로 1번 공격 스프라이트를 공통적으로 사용
//1. 플레이어 위에 단두대 생성, 단두대는 플레이어를 쫓아다니다가 일정시간이 지났을 때 해당 위치에 고정 후 낙하 - OK
//2. 바닥에 랜덤하게 솟아오르는 공격(?) 오브젝트 생성 (단, 오브젝트가 겹치지 않게) - OK
//3. 양 옆으로 광범위 전격 공격을 차례대로 실행 (왼 -> 오) => 광범위 전격 공격을 좌/우 랜덤한 순서로 4회 공격 - OK
//
//특수 패턴 (시간을 들여 공격하는 방식)
//1. 투사체 5개 차례대로 발사하기
//      - 몹의 특정 애니메이션 프레임에 투사체 5개를 간격을 두고 하나씩 플레이어 위치 기준으로 랜덤한 위치로 이동
//      - 일정 시간동안 투사체는 이동한 위치에 머무르고 있으며 투사체의 끝 점이 계속해서 플레이어를 바라봄
//      - 머무르는 시간이 지난 뒤, 하나씩 투사체가 플레이어를 향해 빠르게 날아감
//      - 날아간 투사체는 땅에 박히며, 땅에 박힌 투사체는 타격 판정이 사라짐
//      - 플레이어를 맞춘 투사체는 플레이어를 맞추고 사라지는게 아닌 그대로 관통해서 땅에 박히며 이후 처리는 일반적인 투사체와 같음
//      - 모든 투사체가 땅에 박혔을 경우, 보스는 땅에 박힌 투사체를 회수하며 회수가 끝났을 시 패턴 종로, 대기 상태로 전환
//
//2. 일정 시간 땅에 전류 발생
//      - 일정 시간동안 지상에 전류가 지속적으로 발생
//      - 전류 패턴이 나오기 직전 벽타기를 할 수 있는 벽을 생성
//      - 이후 패턴 지속시간 동안 계속해서 (1) 패턴에서 사용되는 투사체를 끊임 없이 사출
//      - 플레이어는 무적 회피(대시)를 통해 지속적으로 공중에 머물러야 함
//      - QTE 공격 실행 시, 패턴 취소 및 대량의 피해 발생
//
//3. 잡몹 소환
//      - 피통이 증가된 잡몹들 생성
//      - 해당 잡몹이 등장해있는 동안 보스는 맵에서 잠시 이탈
//      - 일정 시간 내에 잡몹 처리를 하지 못했을 시, (4) 패턴 이행
//      - 시간 내에 잡몹을 처리했을 시, 처리하는데 걸린 시간에 따라 보스에게 대량의 피해 발생
//
//4. 해르고 패턴 함 해봐?
